nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/gnss/gnss_interface.c
/*
 * Copyright (c) 2021 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-BSD-5-Clause-Nordic
 */

#include <stdio.h>
#include <string.h>

#include <zephyr.h>
#include <init.h>
#include <shell/shell.h>
#include <assert.h>
#include <nrf_modem_gnss.h>
#if defined(CONFIG_SUPL_CLIENT_LIB)
#include <supl_session.h>
#include <supl_os_client.h>
#endif

#include "gnss.h"
#if defined(CONFIG_SUPL_CLIENT_LIB)
#include "gnss_supl_support.h"
#endif

#define GNSS_DATA_HANDLER_THREAD_STACK_SIZE 768
#define GNSS_DATA_HANDLER_THREAD_PRIORITY   5

#define GNSS_WORKQ_THREAD_STACK_SIZE 2048
#define GNSS_WORKQ_THREAD_PRIORITY   5

enum gnss_operation_mode {
	GNSS_OP_MODE_CONTINUOUS,
	GNSS_OP_MODE_SINGLE_FIX,
	GNSS_OP_MODE_PERIODIC_FIX,
	GNSS_OP_MODE_PERIODIC_FIX_GNSS
};

K_THREAD_STACK_DEFINE(gnss_workq_stack_area, GNSS_WORKQ_THREAD_STACK_SIZE);

static struct k_work_q gnss_work_q;

#if defined(CONFIG_SUPL_CLIENT_LIB)
static struct k_work get_agps_data_work;

static struct nrf_modem_gnss_agps_data_frame agps_data;
#endif

static struct k_work gnss_stop_work;
static struct k_work_delayable gnss_start_work;
static struct k_work_delayable gnss_timeout_work;

extern const struct shell *shell_global;

static enum gnss_operation_mode operation_mode = GNSS_OP_MODE_CONTINUOUS;
static uint32_t periodic_fix_interval;
static uint32_t periodic_fix_retry;
static bool nmea_mask_set;
#if defined(CONFIG_SUPL_CLIENT_LIB)
static bool agps_automatic;
static bool agps_inject_ephe = true;
static bool agps_inject_alm = true;
static bool agps_inject_utc = true;
static bool agps_inject_klob = true;
static bool agps_inject_neq = true;
static bool agps_inject_time = true;
static bool agps_inject_pos = true;
static bool agps_inject_int = true;
#endif

/* Struct for an event item. The data is read in the event handler and passed as a part of the
 * event item because an NMEA string would get overwritten by the next NMEA string before the
 * consumer thread is able to read it. This is not a problem with PVT and AGPS request data, but
 * all data is handled in the same way for simplicity.
 */
struct event_item {
	uint8_t id;
	void    *data;
};

K_MSGQ_DEFINE(event_msgq, sizeof(struct event_item), 10, 4);

/* Output configuration */
static uint8_t pvt_output_level = 2;
static uint8_t nmea_output_level;
static uint8_t event_output_level;

static int get_event_data(void **dest, uint8_t type, size_t len)
{
	void *data;

	data = k_malloc(len);
	if (data == NULL) {
		return -1;
	}

	if (nrf_modem_gnss_read(data, len, type) != 0) {
		printk("Failed to read event data, type %d\n", type);
		k_free(data);
		return -1;
	}

	*dest = data;

	return 0;
}

/* This handler is called in ISR, so need to avoid heavy processing */
static void gnss_event_handler(int event_id)
{
	int err = 0;
	struct event_item event;

	event.id = event_id;
	event.data = NULL;

	/* Copy data for those events which have associated data */
	switch (event_id) {
	case NRF_MODEM_GNSS_EVT_PVT:
		err = get_event_data(&event.data,
				     NRF_MODEM_GNSS_DATA_PVT,
				     sizeof(struct nrf_modem_gnss_pvt_data_frame));
		break;

	case NRF_MODEM_GNSS_EVT_FIX:
		/* Data is not read for the fix notification because we use the PVT notification
		 * and the data is the same.
		 */
		if (operation_mode == GNSS_OP_MODE_PERIODIC_FIX) {
			k_work_cancel_delayable(&gnss_timeout_work);
			k_work_submit_to_queue(&gnss_work_q, &gnss_stop_work);
		}
		break;

	case NRF_MODEM_GNSS_EVT_NMEA:
		err = get_event_data(&event.data,
				     NRF_MODEM_GNSS_DATA_NMEA,
				     sizeof(struct nrf_modem_gnss_nmea_data_frame));
		break;

	case NRF_MODEM_GNSS_EVT_AGPS_REQ:
		err = get_event_data(&event.data,
				     NRF_MODEM_GNSS_DATA_AGPS_REQ,
				     sizeof(struct nrf_modem_gnss_agps_data_frame));
		break;

	default:
		break;
	}

	if (err) {
		/* Failed to get event data */
		return;
	}

	err = k_msgq_put(&event_msgq, &event, K_NO_WAIT);
	if (err) {
		/* Failed to put event into queue */
		k_free(event.data);
	}
}

static void create_timestamp_string(uint32_t timestamp, char *timestamp_str)
{
	uint32_t hours;
	uint32_t mins;
	uint32_t secs;

	secs = timestamp / 1000;
	mins = secs / 60;
	hours = mins / 60;
	secs = secs % 60;
	mins = mins % 60;

	sprintf(timestamp_str, "%02d:%02d:%02d.%03d",
		hours, mins, secs, timestamp % 1000);
}

static void print_pvt_flags(struct nrf_modem_gnss_pvt_data_frame *pvt)
{
	shell_print(shell_global, "\nFix valid:          %s",
		    (pvt->flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) ==
		    NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID ?
		    "true" :
		    "false");
	shell_print(shell_global, "Leap second valid:  %s",
		    (pvt->flags & NRF_MODEM_GNSS_PVT_FLAG_LEAP_SECOND_VALID) ==
		    NRF_MODEM_GNSS_PVT_FLAG_LEAP_SECOND_VALID ?
		    "true" :
		    "false");
	shell_print(shell_global, "Sleep between PVT:  %s",
		    (pvt->flags & NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT) ==
		    NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT ?
		    "true" :
		    "false");
	shell_print(shell_global, "Deadline missed:    %s",
		    (pvt->flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED) ==
		    NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED ?
		    "true" :
		    "false");
	shell_print(shell_global, "Insuf. time window: %s",
		    (pvt->flags & NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME) ==
		    NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME ?
		    "true" :
		    "false");
}

static void print_pvt(struct nrf_modem_gnss_pvt_data_frame *pvt)
{
	if (pvt_output_level == 0) {
		return;
	}

	print_pvt_flags(pvt);

	if ((pvt->flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) ==
	    NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
		shell_print(shell_global, "Time:           %02d.%02d.%04d %02d:%02d:%02d.%03d",
			    pvt->datetime.day,
			    pvt->datetime.month,
			    pvt->datetime.year,
			    pvt->datetime.hour,
			    pvt->datetime.minute,
			    pvt->datetime.seconds,
			    pvt->datetime.ms);
		shell_print(shell_global,
			    "Latitude:       %f\n"
			    "Longitude:      %f\n"
			    "Altitude:       %.1f m\n"
			    "Accuracy:       %.1f m\n"
			    "Speed:          %.1f m/s\n"
			    "Speed accuracy: %.1f m/s\n"
			    "Heading:        %.1f deg\n"
			    "PDOP:           %.1f\n"
			    "HDOP:           %.1f\n"
			    "VDOP:           %.1f\n"
			    "TDOP:           %.1f",
			    pvt->latitude,
			    pvt->longitude,
			    pvt->altitude,
			    pvt->accuracy,
			    pvt->speed,
			    pvt->speed_accuracy,
			    pvt->heading,
			    pvt->pdop,
			    pvt->hdop,
			    pvt->vdop,
			    pvt->tdop);
	}

	if (pvt_output_level < 2) {
		return;
	}

