nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/gnss/gnss_interface.c
	/* SV data */
	for (int i = 0; i < NRF_MODEM_GNSS_MAX_SATELLITES; i++) {
		if (pvt->sv[i].sv == 0) {
			/* SV not valid, skip */
			continue;
		}

		shell_print(shell_global,
			    "SV: %3d C/N0: %4.1f el: %2d az: %3d signal: %d in fix: %d "
			    "unhealthy: %d",
			    pvt->sv[i].sv,
			    pvt->sv[i].cn0 * 0.1,
			    pvt->sv[i].elevation,
			    pvt->sv[i].azimuth,
			    pvt->sv[i].signal,
			    (pvt->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_USED_IN_FIX) ==
			    NRF_MODEM_GNSS_SV_FLAG_USED_IN_FIX ? 1 : 0,
			    (pvt->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_UNHEALTHY) ==
			    NRF_MODEM_GNSS_SV_FLAG_UNHEALTHY ? 1 : 0);
	}
}

static void print_nmea(struct nrf_modem_gnss_nmea_data_frame *nmea)
{
	if (nmea_output_level == 0) {
		return;
	}

	for (int i = 0; i < NRF_MODEM_GNSS_NMEA_MAX_LEN; i++) {
		if (nmea->nmea_str[i] == '\r' || nmea->nmea_str[i] == '\n') {
			nmea->nmea_str[i] = '\0';
			break;
		}
	}
	shell_print(shell_global, "%s", nmea->nmea_str);
}

static void get_agps_data_flags_string(char *flags_string, uint32_t data_flags)
{
	size_t len;

	*flags_string = '\0';

	if ((data_flags & NRF_MODEM_GNSS_AGPS_GPS_UTC_REQUEST) ==
	    NRF_MODEM_GNSS_AGPS_GPS_UTC_REQUEST) {
		(void)strcat(flags_string, "utc | ");
	}
	if ((data_flags & NRF_MODEM_GNSS_AGPS_KLOBUCHAR_REQUEST) ==
	    NRF_MODEM_GNSS_AGPS_KLOBUCHAR_REQUEST) {
		(void)strcat(flags_string, "klob | ");
	}
	if ((data_flags & NRF_MODEM_GNSS_AGPS_NEQUICK_REQUEST) ==
	    NRF_MODEM_GNSS_AGPS_NEQUICK_REQUEST) {
		(void)strcat(flags_string, "neq | ");
	}
	if ((data_flags & NRF_MODEM_GNSS_AGPS_SYS_TIME_AND_SV_TOW_REQUEST) ==
	    NRF_MODEM_GNSS_AGPS_SYS_TIME_AND_SV_TOW_REQUEST) {
		(void)strcat(flags_string, "time | ");
	}
	if ((data_flags & NRF_MODEM_GNSS_AGPS_POSITION_REQUEST) ==
	    NRF_MODEM_GNSS_AGPS_POSITION_REQUEST) {
		(void)strcat(flags_string, "pos | ");
	}
	if ((data_flags & NRF_MODEM_GNSS_AGPS_INTEGRITY_REQUEST) ==
	    NRF_MODEM_GNSS_AGPS_INTEGRITY_REQUEST) {
		(void)strcat(flags_string, "int | ");
	}

	len = strlen(flags_string);
	if (len == 0) {
		(void)strcpy(flags_string, "none");
	} else {
		flags_string[len - 3] = '\0';
	}
}

static void data_handler_thread_fn(void)
{
	struct event_item event;
	char timestamp_str[16];

	while (true) {
		k_msgq_get(&event_msgq, &event, K_FOREVER);

		switch (event.id) {
		case NRF_MODEM_GNSS_EVT_PVT:
			print_pvt((struct nrf_modem_gnss_pvt_data_frame *)event.data);
			break;

		case NRF_MODEM_GNSS_EVT_FIX:
			if (event_output_level > 0) {
				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				shell_print(shell_global, "[%s] GNSS: Got fix", timestamp_str);
			}
			break;

		case NRF_MODEM_GNSS_EVT_NMEA:
			print_nmea((struct nrf_modem_gnss_nmea_data_frame *)event.data);
			break;

		case NRF_MODEM_GNSS_EVT_AGPS_REQ:
			if (event_output_level > 0) {
				char flags_string[48];

				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				get_agps_data_flags_string(
					flags_string,
					((struct nrf_modem_gnss_agps_data_frame *)
					 event.data)->data_flags);

				shell_print(
					shell_global,
					"[%s] GNSS: AGPS data needed (ephe: 0x%08x, alm: 0x%08x, "
					"flags: %s)",
					timestamp_str,
					((struct nrf_modem_gnss_agps_data_frame *)
					 event.data)->sv_mask_ephe,
					((struct nrf_modem_gnss_agps_data_frame *)
					 event.data)->sv_mask_alm,
					flags_string);
			}
#if defined(CONFIG_SUPL_CLIENT_LIB)
			if (agps_automatic) {
				struct nrf_modem_gnss_agps_data_frame *event_agps_data;

				event_agps_data = (struct nrf_modem_gnss_agps_data_frame *)
						  event.data;
				(void)memset(&agps_data, 0, sizeof(agps_data));
				if (agps_inject_ephe) {
					agps_data.sv_mask_ephe = event_agps_data->sv_mask_ephe;
				}
				if (agps_inject_alm) {
					agps_data.sv_mask_alm = event_agps_data->sv_mask_alm;
				}
				if (agps_inject_utc) {
					agps_data.data_flags |=
						event_agps_data->data_flags &
						NRF_MODEM_GNSS_AGPS_GPS_UTC_REQUEST;
				}
				if (agps_inject_klob) {
					agps_data.data_flags |=
						event_agps_data->data_flags &
						NRF_MODEM_GNSS_AGPS_KLOBUCHAR_REQUEST;
				}
				if (agps_inject_neq) {
					agps_data.data_flags |=
						event_agps_data->data_flags &
						NRF_MODEM_GNSS_AGPS_NEQUICK_REQUEST;
				}
				if (agps_inject_time) {
					agps_data.data_flags |=
						event_agps_data->data_flags &
						NRF_MODEM_GNSS_AGPS_SYS_TIME_AND_SV_TOW_REQUEST;
				}
				if (agps_inject_pos) {
					agps_data.data_flags |=
						event_agps_data->data_flags &
						NRF_MODEM_GNSS_AGPS_POSITION_REQUEST;
				}
				if (agps_inject_int) {
					agps_data.data_flags |=
						event_agps_data->data_flags &
						NRF_MODEM_GNSS_AGPS_INTEGRITY_REQUEST;
				}
				k_work_submit_to_queue(&gnss_work_q, &get_agps_data_work);
			}
#endif
			break;

		case NRF_MODEM_GNSS_EVT_BLOCKED:
			if (event_output_level > 0) {
				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				shell_print(shell_global, "[%s] GNSS: Blocked by LTE",
					    timestamp_str);
			}
			break;

		case NRF_MODEM_GNSS_EVT_UNBLOCKED:
			if (event_output_level > 0) {
				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				shell_print(shell_global, "[%s] GNSS: Unblocked by LTE",
					    timestamp_str);
			}
			break;

		case NRF_MODEM_GNSS_EVT_PERIODIC_WAKEUP:
			if (event_output_level > 0) {
				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				shell_print(shell_global, "[%s] GNSS: Wakeup",
					    timestamp_str);
			}
			break;

		case NRF_MODEM_GNSS_EVT_SLEEP_AFTER_TIMEOUT:
			if (event_output_level > 0) {
				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				shell_print(shell_global, "[%s] GNSS: Timeout, entering sleep",
					    timestamp_str);
			}
			break;

		case NRF_MODEM_GNSS_EVT_SLEEP_AFTER_FIX:
			if (event_output_level > 0) {
				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				shell_print(shell_global, "[%s] GNSS: Fix, entering sleep",
					    timestamp_str);
			}
			break;

		case NRF_MODEM_GNSS_EVT_REF_ALT_EXPIRED:
			if (event_output_level > 0) {
				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				shell_print(shell_global,
					    "[%s] GNSS: Reference altitude for 3-satellite fix "
					    "expired",
					    timestamp_str);
			}
			break;

		default:
			if (event_output_level > 0) {
				create_timestamp_string(k_uptime_get_32(), timestamp_str);
				shell_warn(shell_global,
					   "[%s] GNSS: Unknown event %d received",
					   timestamp_str, event.id);
			}
			break;
		}

