nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/gnss/gnss_interface.c
		k_free(event.data);
	}
}

K_THREAD_DEFINE(gnss_data_handler, GNSS_DATA_HANDLER_THREAD_STACK_SIZE,
		data_handler_thread_fn, NULL, NULL, NULL,
		K_PRIO_PREEMPT(GNSS_DATA_HANDLER_THREAD_PRIORITY), 0, 0);

static int gnss_enable_all_nmeas(void)
{
	return nrf_modem_gnss_nmea_mask_set(
		NRF_MODEM_GNSS_NMEA_GGA_MASK |
		NRF_MODEM_GNSS_NMEA_GLL_MASK |
		NRF_MODEM_GNSS_NMEA_GSA_MASK |
		NRF_MODEM_GNSS_NMEA_GSV_MASK |
		NRF_MODEM_GNSS_NMEA_RMC_MASK);
}

#if defined(CONFIG_SUPL_CLIENT_LIB)

static void get_agps_data(struct k_work *item)
{
	ARG_UNUSED(item);

	char flags_string[48];

	get_agps_data_flags_string(flags_string, agps_data.data_flags);

	shell_print(
		shell_global,
		"GNSS: Getting AGPS data (ephe: 0x%08x, alm: 0x%08x, flags: %s)...",
		agps_data.sv_mask_ephe,
		agps_data.sv_mask_alm,
		flags_string);

	if (open_supl_socket() == 0) {
		supl_session((void *)&agps_data);
		close_supl_socket();
	}
}

static void get_agps_data_type_string(char *type_string, uint16_t type)
{
	switch (type) {
	case NRF_MODEM_GNSS_AGPS_UTC_PARAMETERS:
		(void)strcpy(type_string, "utc");
		break;
	case NRF_MODEM_GNSS_AGPS_EPHEMERIDES:
		(void)strcpy(type_string, "ephe");
		break;
	case NRF_MODEM_GNSS_AGPS_ALMANAC:
		(void)strcpy(type_string, "alm");
		break;
	case NRF_MODEM_GNSS_AGPS_KLOBUCHAR_IONOSPHERIC_CORRECTION:
		(void)strcpy(type_string, "klob");
		break;
	case NRF_MODEM_GNSS_AGPS_NEQUICK_IONOSPHERIC_CORRECTION:
		(void)strcpy(type_string, "neq");
		break;
	case NRF_MODEM_GNSS_AGPS_GPS_SYSTEM_CLOCK_AND_TOWS:
		(void)strcpy(type_string, "time");
		break;
	case NRF_MODEM_GNSS_AGPS_LOCATION:
		(void)strcpy(type_string, "pos");
		break;
	case NRF_MODEM_GNSS_AGPS_INTEGRITY:
		(void)strcpy(type_string, "int");
		break;
	default:
		(void)strcpy(type_string, "UNKNOWN");
		break;
	}
}

static int inject_agps_data(void *agps,
			    size_t agps_size,
			    uint16_t type,
			    void *user_data)
{
	ARG_UNUSED(user_data);

	int err;
	char type_string[16];

	err = nrf_modem_gnss_agps_write(agps, agps_size, type);

	get_agps_data_type_string(type_string, type);

	if (err) {
		shell_error(shell_global,
			    "GNSS: Failed to send AGPS data, type: %s (err: %d)",
			    type_string,
			    errno);
		return err;
	}

	shell_print(shell_global,
		    "GNSS: Injected AGPS data, type: %s, size: %d",
		    type_string,
		    agps_size);

	return 0;
}

#endif /* CONFIG_SUPL_CLIENT_LIB */

static void start_gnss_work_fn(struct k_work *item)
{
	ARG_UNUSED(item);

	int err;
	char timestamp_str[16];

	err = nrf_modem_gnss_start();

	if (err) {
		shell_error(shell_global, "GNSS: Failed to start GNSS");
	} else {
		if (event_output_level > 0) {
			create_timestamp_string(k_uptime_get_32(), timestamp_str);

			shell_print(shell_global, "[%s] GNSS: Search started",
				    timestamp_str);
		}
	}

	k_work_schedule_for_queue(&gnss_work_q,
				  &gnss_start_work,
				  K_SECONDS(periodic_fix_interval));

	if (periodic_fix_retry > 0 && periodic_fix_retry < periodic_fix_interval) {
		k_work_schedule_for_queue(&gnss_work_q,
					  &gnss_timeout_work,
					  K_SECONDS(periodic_fix_retry));
	}
}

static void stop_gnss_work_fn(struct k_work *item)
{
	ARG_UNUSED(item);

	int err;

	err = nrf_modem_gnss_stop();
	if (err) {
		shell_error(shell_global, "GNSS: Failed to stop GNSS");
	}
}

static void handle_timeout_work_fn(struct k_work *item)
{
	ARG_UNUSED(item);

	int err;
	char timestamp_str[16];

	if (event_output_level > 0) {
		create_timestamp_string(k_uptime_get_32(), timestamp_str);

		shell_print(shell_global, "[%s] GNSS: Search timeout",
			    timestamp_str);
	}

	err = nrf_modem_gnss_stop();
	if (err) {
		shell_error(shell_global, "GNSS: Failed to stop GNSS");
	}
}

static void gnss_api_init(void)
{
	int err;
	static bool gnss_api_initialized;

	if (gnss_api_initialized) {
		return;
	}

	/* Activate GNSS API v2 */
	err = nrf_modem_gnss_init();

	if (!err) {
		err = nrf_modem_gnss_event_handler_set(gnss_event_handler);
	}

	if (!err) {
		gnss_api_initialized = true;

		k_work_queue_start(
			&gnss_work_q,
			gnss_workq_stack_area,
			K_THREAD_STACK_SIZEOF(gnss_workq_stack_area),
			GNSS_WORKQ_THREAD_PRIORITY,
			NULL);

		k_work_init(&gnss_stop_work, stop_gnss_work_fn);
		k_work_init_delayable(&gnss_start_work, start_gnss_work_fn);
		k_work_init_delayable(&gnss_timeout_work, handle_timeout_work_fn);

#if defined(CONFIG_SUPL_CLIENT_LIB)
		k_work_init(&get_agps_data_work, get_agps_data);

		static struct supl_api supl_api = {
			.read = supl_read,
			.write = supl_write,
			.handler = inject_agps_data,
			.logger = NULL, /* set to "supl_logger" to enable logging */
			.counter_ms = k_uptime_get
		};

		(void)supl_init(&supl_api);
#endif
	} else {
		shell_error(shell_global, "GNSS: Failed to initialize GNSS API");
	}
}

int gnss_start(void)
{
	int err;

	gnss_api_init();

	if (!nmea_mask_set) {
		/* Enable all NMEAs by default */
		if (gnss_enable_all_nmeas() == 0) {
			nmea_mask_set = true;
		}
	}

	if (operation_mode == GNSS_OP_MODE_PERIODIC_FIX) {
		k_work_schedule_for_queue(&gnss_work_q, &gnss_start_work, K_NO_WAIT);
		return 0;
	}

	err = nrf_modem_gnss_start();
	if (err) {
		shell_error(shell_global, "GNSS: Failed to start GNSS");
	}

	return err;
}

int gnss_stop(void)
{
	int err;

	gnss_api_init();

	if (operation_mode == GNSS_OP_MODE_PERIODIC_FIX) {
		k_work_cancel_delayable(&gnss_timeout_work);
		k_work_cancel_delayable(&gnss_start_work);
		nrf_modem_gnss_stop();
		return 0;
	}

	err = nrf_modem_gnss_stop();
	if (err) {
		shell_error(shell_global, "GNSS: Failed to stop GNSS");
	}

	return err;
}


int gnss_delete_data(enum gnss_data_delete data)
{
	int err;
	uint32_t delete_mask;

	gnss_api_init();

	switch (data) {
	case GNSS_DATA_DELETE_EPHEMERIDES:
		delete_mask = NRF_MODEM_GNSS_DELETE_EPHEMERIDES;
		break;

	case GNSS_DATA_DELETE_ALL:
		/* Delete everything else but TCXO frequency offset data */
		delete_mask = NRF_MODEM_GNSS_DELETE_EPHEMERIDES |
			      NRF_MODEM_GNSS_DELETE_ALMANACS |
			      NRF_MODEM_GNSS_DELETE_IONO_CORRECTION_DATA |
			      NRF_MODEM_GNSS_DELETE_LAST_GOOD_FIX |
			      NRF_MODEM_GNSS_DELETE_GPS_TOW |
			      NRF_MODEM_GNSS_DELETE_GPS_WEEK |
			      NRF_MODEM_GNSS_DELETE_UTC_DATA;
		break;

	default:
		shell_error(shell_global, "GNSS: Invalid erase data value");
		return -1;
	}

	err = nrf_modem_gnss_nv_data_delete(delete_mask);
	if (err) {
		shell_error(shell_global, "GNSS: Failed to delete NV data");
	}

