nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/gnss/gnss_interface.c
		err = nrf_modem_gnss_1pps_enable(&pps_config);
	} else {
		err = nrf_modem_gnss_1pps_disable();
	}

	if (err) {
		shell_error(shell_global, "GNSS: Failed to set 1PPS mode");
	}

	return err;
}

int gnss_set_timing_source(enum gnss_timing_source source)
{
	int err;
	uint8_t timing_source;

	gnss_api_init();

	switch (source) {
	case GNSS_TIMING_SOURCE_RTC:
		timing_source = NRF_MODEM_GNSS_TIMING_SOURCE_RTC;
		break;

	case GNSS_TIMING_SOURCE_TCXO:
		timing_source = NRF_MODEM_GNSS_TIMING_SOURCE_TCXO;
		break;

	default:
		shell_error(shell_global, "GNSS: Invalid timing source");
		return -EINVAL;
	}

	err = nrf_modem_gnss_timing_source_set(timing_source);
	if (err) {
		shell_error(shell_global, "GNSS: Failed to set timing source");
	}

	return err;
}

int gnss_set_agps_data_enabled(bool ephe, bool alm, bool utc, bool klob,
			       bool neq, bool time, bool pos, bool integrity)
{
#if defined(CONFIG_SUPL_CLIENT_LIB)
	agps_inject_ephe = ephe;
	agps_inject_alm = alm;
	agps_inject_utc = utc;
	agps_inject_klob = klob;
	agps_inject_neq = neq;
	agps_inject_time = time;
	agps_inject_pos = pos;
	agps_inject_int = integrity;

	return 0;
#else
	shell_error(shell_global, "GNSS: Enable CONFIG_SUPL_CLIENT_LIB for AGPS support");
	return -EOPNOTSUPP;
#endif
}

int gnss_set_agps_automatic(bool value)
{
#if defined(CONFIG_SUPL_CLIENT_LIB)
	agps_automatic = value;

	return 0;
#else
	shell_error(shell_global, "GNSS: Enable CONFIG_SUPL_CLIENT_LIB for AGPS support");
	return -EOPNOTSUPP;
#endif
}

int gnss_inject_agps_data(void)
{
#if defined(CONFIG_SUPL_CLIENT_LIB)
	gnss_api_init();

	(void)memset(&agps_data, 0, sizeof(agps_data));
	if (agps_inject_ephe) {
		agps_data.sv_mask_ephe = 0xffffffff;
	}
	if (agps_inject_alm) {
		agps_data.sv_mask_alm = 0xffffffff;
	}
	if (agps_inject_utc) {
		agps_data.data_flags |= NRF_MODEM_GNSS_AGPS_GPS_UTC_REQUEST;
	}
	if (agps_inject_klob) {
		agps_data.data_flags |= NRF_MODEM_GNSS_AGPS_KLOBUCHAR_REQUEST;
	}
	if (agps_inject_neq) {
		agps_data.data_flags |= NRF_MODEM_GNSS_AGPS_NEQUICK_REQUEST;
	}
	if (agps_inject_time) {
		agps_data.data_flags |= NRF_MODEM_GNSS_AGPS_SYS_TIME_AND_SV_TOW_REQUEST;
	}
	if (agps_inject_pos) {
		agps_data.data_flags |= NRF_MODEM_GNSS_AGPS_POSITION_REQUEST;
	}
	if (agps_inject_int) {
		agps_data.data_flags |= NRF_MODEM_GNSS_AGPS_INTEGRITY_REQUEST;
	}

	k_work_submit_to_queue(&gnss_work_q, &get_agps_data_work);

	return 0;
#else
	shell_error(shell_global, "GNSS: Enable CONFIG_SUPL_CLIENT_LIB for AGPS support");
	return -EOPNOTSUPP;
#endif
}

int gnss_set_pvt_output_level(uint8_t level)
{
	if (level < 0 || level > 2) {
		return -EINVAL;
	}

	pvt_output_level = level;

	return 0;
}

int gnss_set_nmea_output_level(uint8_t level)
{
	if (level < 0 || level > 1) {
		return -EINVAL;
	}

	nmea_output_level = level;

	return 0;
}

int gnss_set_event_output_level(uint8_t level)
{
	if (level < 0 || level > 1) {
		return -EINVAL;
	}

	event_output_level = level;

	return 0;
}
